; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-21)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city15)
	(fuel-level plane1 fl1)
	(at plane2 city0)
	(fuel-level plane2 fl6)
	(at plane3 city8)
	(fuel-level plane3 fl0)
	(at person1 city1)
	(at person2 city12)
	(at person3 city4)
	(at person4 city5)
	(at person5 city7)
	(at person6 city13)
	(at person7 city0)
	(at person8 city7)
	(at person9 city1)
	(at person10 city14)
	(at person11 city3)
	(at person12 city1)
	(at person13 city18)
	(at person14 city9)
	(at person15 city8)
	(at person16 city16)
	(at person17 city17)
	(at person18 city7)
	(at person19 city4)
	(at person20 city18)
	(at person21 city7)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city3)
	(at person2 city1)
	(at person3 city6)
	(at person4 city15)
	(at person5 city18)
	(at person6 city11)
	(at person7 city16)
	(at person8 city18)
	(at person9 city3)
	(at person10 city0)
	(at person11 city2)
	(at person12 city14)
	(at person13 city0)
	(at person14 city5)
	(at person15 city13)
	(at person16 city8)
	(at person17 city8)
	(at person18 city15)
	(at person19 city16)
	(at person20 city12)
	(at person21 city15)
	))

)

; plan
1. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 0 of 21
2. (board person15 plane3 city8)
   deleted: (at person15 city8)
   added: (in person15 plane3)
   goals met: 0 of 21
3. (fly plane3 city8 city13 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 0 of 21
4. (board person6 plane3 city13)
   deleted: (at person6 city13)
   added: (in person6 plane3)
   goals met: 0 of 21
5. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 0 of 21
6. (debark person15 plane3 city13)
   deleted: (in person15 plane3)
   added: (at person15 city13)
   goals met: 1 of 21
7. (fly plane3 city13 city11 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city11) (fuel-level plane3 fl0)
   goals met: 1 of 21
8. (debark person6 plane3 city11)
   deleted: (in person6 plane3)
   added: (at person6 city11)
   goals met: 2 of 21
9. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   goals met: 2 of 21
10. (zoom plane2 city0 city16 fl6 fl5 fl4)
   deleted: (at plane2 city0) (fuel-level plane2 fl6)
   added: (at plane2 city16) (fuel-level plane2 fl4)
   goals met: 2 of 21
11. (debark person7 plane2 city16)
   deleted: (in person7 plane2)
   added: (at person7 city16)
   goals met: 3 of 21
12. (board person16 plane2 city16)
   deleted: (at person16 city16)
   added: (in person16 plane2)
   goals met: 3 of 21
13. (zoom plane2 city16 city8 fl4 fl3 fl2)
   deleted: (at plane2 city16) (fuel-level plane2 fl4)
   added: (at plane2 city8) (fuel-level plane2 fl2)
   goals met: 3 of 21
14. (debark person16 plane2 city8)
   deleted: (in person16 plane2)
   added: (at person16 city8)
   goals met: 4 of 21
15. (fly plane1 city15 city1 fl1 fl0)
   deleted: (at plane1 city15) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 4 of 21
16. (board person9 plane1 city1)
   deleted: (at person9 city1)
   added: (in person9 plane1)
   goals met: 4 of 21
17. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 4 of 21
18. (board person12 plane1 city1)
   deleted: (at person12 city1)
   added: (in person12 plane1)
   goals met: 4 of 21
19. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   goals met: 4 of 21
20. (fly plane1 city1 city3 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 4 of 21
21. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 4 of 21
22. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   goals met: 5 of 21
23. (board person11 plane1 city3)
   deleted: (at person11 city3)
   added: (in person11 plane1)
   goals met: 5 of 21
24. (debark person1 plane1 city3)
   deleted: (in person1 plane1)
   added: (at person1 city3)
   goals met: 6 of 21
25. (fly plane1 city3 city14 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 6 of 21
26. (refuel plane1 city14 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 21
27. (debark person12 plane1 city14)
   deleted: (in person12 plane1)
   added: (at person12 city14)
   goals met: 7 of 21
28. (board person10 plane1 city14)
   deleted: (at person10 city14)
   added: (in person10 plane1)
   goals met: 7 of 21
29. (zoom plane2 city8 city12 fl2 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl2)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 7 of 21
30. (board person2 plane2 city12)
   deleted: (at person2 city12)
   added: (in person2 plane2)
   goals met: 7 of 21
31. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 21
32. (fly plane1 city14 city0 fl1 fl0)
   deleted: (at plane1 city14) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 7 of 21
33. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 21
34. (debark person10 plane1 city0)
   deleted: (in person10 plane1)
   added: (at person10 city0)
   goals met: 8 of 21
35. (fly plane2 city12 city17 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city17) (fuel-level plane2 fl0)
   goals met: 8 of 21
36. (refuel plane2 city17 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 21
37. (board person17 plane2 city17)
   deleted: (at person17 city17)
   added: (in person17 plane2)
   goals met: 8 of 21
38. (fly plane2 city17 city1 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 8 of 21
39. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 21
40. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   goals met: 9 of 21
41. (fly plane2 city1 city18 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 9 of 21
42. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 21
43. (board person20 plane2 city18)
   deleted: (at person20 city18)
   added: (in person20 plane2)
   goals met: 9 of 21
44. (board person13 plane2 city18)
   deleted: (at person13 city18)
   added: (in person13 plane2)
   goals met: 9 of 21
45. (fly plane2 city18 city0 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 9 of 21
46. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 21
47. (debark person13 plane2 city0)
   deleted: (in person13 plane2)
   added: (at person13 city0)
   goals met: 10 of 21
48. (fly plane2 city0 city12 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 10 of 21
49. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 21
50. (debark person20 plane2 city12)
   deleted: (in person20 plane2)
   added: (at person20 city12)
   goals met: 11 of 21
51. (fly plane2 city12 city4 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 11 of 21
52. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 21
53. (board person3 plane2 city4)
   deleted: (at person3 city4)
   added: (in person3 plane2)
   goals met: 11 of 21
54. (board person19 plane2 city4)
   deleted: (at person19 city4)
   added: (in person19 plane2)
   goals met: 11 of 21
55. (fly plane2 city4 city16 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 11 of 21
56. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 21
57. (debark person19 plane2 city16)
   deleted: (in person19 plane2)
   added: (at person19 city16)
   goals met: 12 of 21
58. (fly plane2 city16 city6 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 12 of 21
59. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 21
60. (debark person3 plane2 city6)
   deleted: (in person3 plane2)
   added: (at person3 city6)
   goals met: 13 of 21
61. (fly plane2 city6 city5 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 13 of 21
62. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 21
63. (board person4 plane2 city5)
   deleted: (at person4 city5)
   added: (in person4 plane2)
   goals met: 13 of 21
64. (fly plane2 city5 city15 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 13 of 21
65. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 21
66. (debark person4 plane2 city15)
   deleted: (in person4 plane2)
   added: (at person4 city15)
   goals met: 14 of 21
67. (fly plane2 city15 city7 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 14 of 21
68. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 21
69. (board person8 plane2 city7)
   deleted: (at person8 city7)
   added: (in person8 plane2)
   goals met: 14 of 21
70. (board person5 plane2 city7)
   deleted: (at person5 city7)
   added: (in person5 plane2)
   goals met: 14 of 21
71. (board person21 plane2 city7)
   deleted: (at person21 city7)
   added: (in person21 plane2)
   goals met: 14 of 21
72. (board person18 plane2 city7)
   deleted: (at person18 city7)
   added: (in person18 plane2)
   goals met: 14 of 21
73. (fly plane2 city7 city15 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 14 of 21
74. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 21
75. (debark person21 plane2 city15)
   deleted: (in person21 plane2)
   added: (at person21 city15)
   goals met: 15 of 21
76. (debark person18 plane2 city15)
   deleted: (in person18 plane2)
   added: (at person18 city15)
   goals met: 16 of 21
77. (fly plane2 city15 city18 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 16 of 21
78. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 16 of 21
79. (debark person8 plane2 city18)
   deleted: (in person8 plane2)
   added: (at person8 city18)
   goals met: 17 of 21
80. (debark person5 plane2 city18)
   deleted: (in person5 plane2)
   added: (at person5 city18)
   goals met: 18 of 21
81. (fly plane2 city18 city8 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 18 of 21
82. (debark person17 plane2 city8)
   deleted: (in person17 plane2)
   added: (at person17 city8)
   goals met: 19 of 21
83. (fly plane1 city0 city2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 19 of 21
84. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 21
85. (debark person11 plane1 city2)
   deleted: (in person11 plane1)
   added: (at person11 city2)
   goals met: 20 of 21
86. (fly plane1 city2 city9 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 20 of 21
87. (board person14 plane1 city9)
   deleted: (at person14 city9)
   added: (in person14 plane1)
   goals met: 20 of 21
88. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 21
89. (fly plane1 city9 city5 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 20 of 21
90. (debark person14 plane1 city5)
   deleted: (in person14 plane1)
   added: (at person14 city5)
   goals met: 21 of 21
